import { Link } from "react-router-dom";
import { AgreeWrap } from "./agreePageStyle";

const PersonalInformation = () => {
  return (
    <AgreeWrap>
      <h2 className="title">[개인정보 수집 이용 동의]</h2>
      <div className="desc">
        회원가입 수집·이용 동의서
        <br />
        <br />
        마이스메이트 (주식회사 마인즈그라운드)의 개인정보 수집 이용 목적은
        다음과 같습니다.
        <br />
        내용을 자세히 읽어 보신 후 동의 여부를 결정하여 주시기 바랍니다.
        <br />
        <br />
        수집 목적: 회원가입 및 이용자 식별
        <br />
        필수수집 항목: 이름, 이메일, 비밀번호, 카카오톡ID, 네이버ID
        <br />
        선택수집 항목: 전화번호, 소속, 부서, 직급/직할, 출생년도, 성별,
        활동지역, 관심분야
        <br />
        보유·이용기간: 회원탈퇴 까지
        <br />
        <br />
        수집 목적: 서비스관련 각종 고지 안내
        <br />
        수집 항목: 이름, 이메일, 휴대전화번호
        <br />
        보유·이용기간: 회원탈퇴 까지
        <br />
        수집 목적: 고객 관계 관리(CRM)
        <br />
        필수수집 항목: 이름, 이메일
        <br />
        선택수집 항목: 전화번호, 소속 및 직함, 연령, 성별
        <br />
        보유·이용기간: 회원탈퇴 까지
        <br />
        <br />
        수집 목적: 행사 참가자 식별 및 행사 운영
        <br />
        필수수집 항목: 이메일, 이름, 성별
        <br />
        선택수집 항목: 휴대전화번호, 기타 호스트가 요청하는 정보
        <br />
        보유·이용기간: 회원탈퇴 까지
        <br />
        <br />
        자세한 내용은 <Link to="/privacy-policy">개인정보처리방침(링크)</Link>을
        확인해주세요.
        <br />
        귀하는 위와 같이 개인정보를 수집·이용하는데 동의를 거부할 권리가
        있습니다. <br />
        필수 수집 항목에 대한 동의를 거절하는 경우 서비스 이용이 제한 될 수
        있습니다.
        <br />
      </div>
    </AgreeWrap>
  );
};

export default PersonalInformation;
