import { AgreeWrap } from "./agreePageStyle";

const PrivacyPolicy = () => {
  return (
    <AgreeWrap>
      <h2 className="title">&#91;마이스 메이트 개인정보 처리방침&#93;</h2>
      <div className="desc">
        <div className="box">
          '주식회사 마인즈그라운드'&#40;이하 '회사'&#41;이&#40;가&#41; 운영하는
          ‘마이스메이트’가 취급하는 모든 개인정보는 개인정보 보호법 및 “회사”
          개인정보 보호지침 등 관련 법령상의 개인정보 보호 규정을 준수하여
          수집,보유, 처리 되고 있습니다.
          <br /> 시행일 : 2024-10-30
        </div>
        <div className="box">
          "회사"는 개인정보 보호법에 따라 이용자의 개인정보 보호 및 권익을
          보호하고 개인정보와 관련한 이용자의 고충을 원활하게 처리할 수 있도록
          다음과 같은 처리방침을 두고 있습니다.
          <br /> "회사"는 개인정보 처리방침을 변경하는 경우에는 시행의 시기,
          변경된 내용을 정보주체가 쉽게 확인할 수 있도록 변경 전·후를 비교하여
          공개하도록 할 예정입니다.
        </div>

        <h3>
          1. 개인정보의 처리목적, 개인정보의 처리 및 보유기간, 처리하는
          개인정보의 항목
        </h3>
        <div className="box">
          "회사가 인터넷을통해 제공하는 전시회 정보 플랫폼 ‘’&#40;이하 "마이스
          메이트"라 한다&#41;는 개인정보를 다음의 목적을 위해 수집합니다.
          <br />
          수집한 개인정보는 다음의 목적 이외의 용도로는 사용되지 않으며 이용
          목적이 변경될 시에는 사전동의를 구할 예정입니다.
        </div>
        <h4>1&#41; 홈페이지 회원가입 및 관리</h4>
        <div className="box">
          회원 가입의사 확인, 회원제 서비스 제공에 따른 본인 식별 및 인증,
          회원자격 유지 및 관리, 서비스 부정이용 방지, 각종 고지 및 통지 등을
          목적으로 개인정보를 처리합니다.
        </div>
        <h3>2. 수집하는 개인정보의 항목</h3>
        <div className="box">
          "마이스 메이트"는 서비스 제공을 위해 필요한 최소한의 범위 내에서
          다음과 같은 개인정보를 수집하고 있습니다. 선택항목 정보는 회원에게 더
          나은 서비스를 제공하기 위해 추가로 수집하는 정보입니다. 회원이 원하지
          않을 경우 해당 추가정보는 수집하지 않으며, 이로 인한 서비스 이용 상의
          제한은 없습니다.
        </div>
        <h4>1&#41; 수집 항목</h4>
        <div className="box">
          - 전시주최자/호스트 회원 : 상호/업체명, 사업자등록번호, 대표자명,
          사업장 소재지, 담당자명, 담당자 연락처&#40;휴대폰&#41;, 이메일 주소,
          회사홈페이지, 블로그, 페이스북, 인스타그램
          <br />- 일반회원 : 이름, 연락처&#40;휴대폰&#41;, 이메일 주소, 성별,
          연령
        </div>
        <h3>3. 개인정보의 처리 및 보유기간</h3>
        <div className="box">
          회원의 개인정보는 원칙적으로 개인정보의 처리목적이 달성되거나 해당
          서비스가 폐지되면 지체없이 파기합니다.
          <br />
          단, 다음의 정보에 대하여는 아래의 사유로 일정기간 동안 보존합니다. -
          보유기간 : 2년 또는 회원 탈퇴 시까지
        </div>
        <h3>4. 개인정보의 제3자 제공</h3>
        <div className="box">
          "회사"는 원칙적으로 정보주체의 개인정보를 수집·이용 목적으로 명시한
          범위 내에서 처리하며, 아래의 경우를 제외하고는 정보주체의 사전 동의
          없이는 본래의 목적 범위를 초과하여 처리하거나 제3자에게 제공하지
          않습니다.
        </div>
        <h4>1&#41; 정보주체로부터 별도의 동의를 받는 경우</h4>
        <h4>2&#41; 법률에 특별한 규정이 있는 경우</h4>
        <h4>
          3&#41; 정보주체 또는 법정대리인이 의사표시를 할 수 없는 상태에 있거나
          주소불명 등으로 사전 동의를 받을 수 없는 경우로서 명백히 정보주체 또는
          제3자의 급박한 생명, 신체, 재산의 이익을 위하여 필요하다고 인정되는
          경우
        </h4>
        <h4>
          4&#41; 통계작성 및 학술연구 등의 목적을 위하여 필요한 경우로서 특정
          개인을 알아 볼 수 없는 형태로 개인정보를 제공하는 경우
        </h4>
        <h4>
          5&#41; 개인정보를 목적 외의 용도로 이용하거나 이를 제3자에게 제공하지
          아니하면 다른 법률에서 정하는 소관 업무를 수행할 수 없는 경우로서
          보호위원회의 심의·의결을 거친 경우
        </h4>
        <h4>
          4&#41; 통계작성 및 학술연구 등의 목적을 위하여 필요한 경우로서 특정
          개인을 알아 볼 수 없는 형태로 개인정보를 제공하는 경우
        </h4>
        <h4>
          6&#41; 조약, 그 밖의 국제협정의 이행을 위하여 외국정보 또는 국제기구에
          제공하기 위하여 필요한 경우
        </h4>
        <h4>7&#41; 범죄의 수사와 공소의 제기 및 유지를 위하여 필요한 경우</h4>
        <h4>8&#41; 법원의 재판업무 수행을 위하여 필요한 경우</h4>
        <h4>9&#41; 형 및 감호, 보호처분의 집행을 위하여 필요한 경우</h4>
        <h3>5. 정보주체의 권리·의무 및 그 행사 방법</h3>
        <div className="box">
          정보주체는 아래와 같은 권리를 행사 할 수 있으며, 만14세 미만 아동의
          법정대리인은 그 아동의 개인정보에 대한 열람, 정정·삭제, 처리정지를
          요구할 수 있습니다.
        </div>
        <h4>1&#41; 개인정보 열람 요구</h4>
        <div className="box">
          "회사"에서 보유하고 있는 개인정보파일은「개인정보
          보호법」제35조&#40;개인정보의 열람&#41;에 따라 자신의 개인정보에 대한
          열람을 요구할 수 있습니다.
          <br />
          다만, 개인정보 열람 요구는 법 제35조 5항에 의하여 아래와 같이 제한될
          수 있습니다.
        </div>

        <h5>가. 정보주체로부터 별도의 동의를 받는 경우</h5>
        <h5>
          나. 다른 사람의 생명·신체를 해할 우려가 있거나 다른 사람의 재산과 그
          밖의 이익을 부당하게 침해할 우려가 있는 경우
        </h5>
        <h5>
          다. 공공기관이 아래 각 목의 어느 하나에 해당하는 업무를 수행할 때
          중대한 지장을 초래하는 경우
        </h5>
        <div className="box">
          - 조세의 부과·징수 또는 환급에 관한 업무 - 학력·기능 및 채용에 관한
          시험, 자격 심사에 관한 업무
          <br /> - 보상금·급부금 산정 등에 대하여 진행 중인 평가 또는 판단에
          관한 업무
          <br /> - 다른 법률에 따라 진행 중인 감사 및 조사에 관한 업무
        </div>
        <h4>2&#41; 개인정보 정정·삭제 요구</h4>
        <div className="box">
          "회사"에서 보유하고 있는 개인정보파일은「개인정보
          보호법」제36조&#40;개인정보의 정정·삭제&#41;에 따라 정정·삭제를 요구할
          수 있습니다.
          <br />
          다만, 다른 법령에서 그 개인정보가 수집 대상으로 명시되어 있는 경우에는
          그 삭제를 요구할 수 없습니다.
        </div>
        <h4>3&#41; 개인정보 처리정지 요구</h4>
        <div className="box">
          "회사"에서 보유하고 있는 개인정보파일은 「개인정보보호법」
          제37조&#40;개인정보의 처리정지 등&#41;에 따라 처리정지를 요구할 수
          있습니다.
          <br />
          다만, 개인정보 처리정지 요구는 법 제37조 2항에 의하여 거절될 수
          있습니다.
        </div>
        <h5>
          가. 법률에 특별한 규정이 있거나 법령상 의무를 준수하기 위하여 불가피한
          경우
        </h5>
        <h5>
          나. 다른 사람의 생명·신체를 해할 우려가 있거나 다른 사람의 재산과 그
          밖의 이익을 부당하게 침해할 우려가 있는 경우
        </h5>
        <h5>
          다. 공공기관이 개인정보를 처리하지 아니하면 다른 법률에서 정하는 소관
          업무를 수행할 수 없는 경우
        </h5>
        <h5>
          라. 개인정보를 처리하지 아니하면 정보주체와 약정한 서비스를 제공하지
          못하는 등 계약의 이행이 곤란한 경우로서 정보주체가 계약의 해지 의사를
          명확하게 밝히지 아니한 경우
        </h5>
        <h3>6. 개인정보의 파기</h3>
        <div className="box">
          "회사"는 원칙적으로 개인정보 보존기간이 경과되거나, 개인정보
          처리목적이 달성된 경우에는 지체 없이 파기합니다. 파기의 절차, 기한 및
          방법은 아래와 같습니다.
        </div>
        <h4>1&#41; 파기 절차</h4>
        <div className="box">
          개인정보는 목적 달성 후 즉시 또는 별도의 공간에 옮겨져 내부 방침 및
          기타 관련법령에 따라 일정기간 저장된 후 파기됩니다. 별도의 공간으로
          옮겨진 개인정보는 법률에 의한 경우가 아니고서는 다른 목적으로 이용되지
          않습니다.
        </div>
        <h4>2&#41; 파기 기한 및 파기 방법</h4>
        <div className="box">
          보유기간이 만료되었거나 개인정보의 처리목적달성, 해당 업무의 폐지 등
          그 개인정보가 불필요하게 되었을 때에는 지체없이 파기합니다. 전자적
          파일형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다.
          <br />
          종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기합니다.
        </div>
        <h3>7. 개인정보의 안전성 확보 조치</h3>
        <div className="box">
          "회사"는 개인정보 보호법 제29조에 따라 다음과 같이 안전성 확보에
          필요한 기술적, 관리적, 물리적 조치를 하고 있습니다.
        </div>
        <h4>1&#41; 개인정보 취급직원의 최소화 및 교육</h4>
        <div className="box">
          개인정보를 취급하는 직원은 반드시 필요한 인원에 한하여 지정 · 관리하고
          있으며 취급직원을 대상으로 안전한 관리를 위한 교육을 실시하고
          있습니다.
        </div>
        <h4>2&#41; 개인정보에 대한 접근 제한</h4>
        <div className="box">
          개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의
          부여·변경·말소를 통하여 개인정보에 대한 접근통제를 위한 필요한 조치를
          하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단 접근을
          통제하고 있습니다.
        </div>
        <h4>3&#41; 접속기록의 보관</h4>
        <div className="box">
          개인정보처리시스템에 접속한 기록&#40;웹 로그, 요약정보 등&#41;을 최소
          6개월 이상 보관·관리하고 있습니다.
        </div>
        <h4>4&#41; 개인정보의 암호화</h4>
        <div className="box">
          개인정보는 암호화 등을 통해 안전하게 저장 및 관리되고 있습니다. 또한
          중요한 데이터는 저장 및 전송 시 암호화하여 사용하는 등의 별도
          보안기능을 사용하고 있습니다.
        </div>
        <h4>5&#41; 보안프로그램 설치 및 주기적 점검·갱신</h4>
        <div className="box">
          해킹이나 컴퓨터 바이러스 등에 의한 개인정보 유출 및 훼손을 막기 위하여
          보안프로그램을 설치하고 주기적으로 갱신·점검하고 있습니다.
        </div>
        <h4>6&#41; 비인가자에 대한 출입 통제</h4>
        <div className="box">
          개인정보를 보관하고 있는 개인정보시스템의 물리적 보관 장소를 별도로
          두고 이에 대해 출입통제 절차를 수립, 운영하고 있습니다.
        </div>
        <h4>7&#41; 정기적인 자체 점검 실시</h4>
        <div className="box">
          개인정보 취급 관련 안정성 확보를 위해 정기적으로 소속·산하기관을
          포함하여 개인정보 보호관리 점검을 실시하고 있습니다.
        </div>
        <h4>8&#41; 내부관리계획의 수립 및 시행</h4>
        <div className="box">
          개인정보의 안전한 처리를 위하여 내부관리계획을 수립하고 시행하고
          있습니다.
        </div>
        <h3>8. 개인정보 보호책임자 및 담당자</h3>
        <div className="box">
          "회사"는 개인정보를 보호하고 개인정보와 관련한 불만을 처리하기 위하여
          아래와 같이 개인정보 보호 책임 담당부서를 지정하고 있습니다.
        </div>
        <h4>1&#41; 개인정보보호 담당자 부서: 경영지원팀 </h4>
        <div className="box">연락처 : admin@mindsground.com</div>
        <h3>9. 권익침해 구제방법</h3>
        <div className="box">
          개인정보주체 및 법정대리인은 개인정보침해로 인한 피해를 구제 받기
          위하여 개인정보 분쟁조정위원회, 한국인터넷진흥원 개인정보 침해신고센터
          등에 분쟁해결이나 상담 등을 신청할 수 있습니다. 또한, 개인정보의 열람,
          정정·삭제, 처리정지 등에 대한 정보주체자의 요구에 대하여 공공기관의
          장이 행한 처분 또는 부작위로 인하여 권리 또는 이익을 침해 받은 자는
          행정심판법이 정하는 바에 따라 행정심판을 청구할 수 있습니다.
        </div>
        <h4>
          1&#41; 개인정보 분쟁조정위원회 : 2-2100-2499&#40;
          <button
            onClick={() => {
              window.open("https://www.kopico.go.kr");
            }}
          >
            www.kopico.go.kr
          </button>
          &#41;,&#40;국번없이&#41; 118
        </h4>
        <h4>
          2&#41; 개인정보 침해신고센터 : &#40;국번없이&#41; 118 &#40;
          privacy.kisa.or.kr&#41;
        </h4>
        <h4>
          3&#41; 대검찰청 사이버범죄수사과 : 02-3480-3570 &#40;
          cybercid@spo.go.kr&#41;
        </h4>
        <h4>
          4&#41; 경찰청 사이버안전국 : 02-3150-2659 &#40;
          cyberbureau.police.go.kr&#41;
        </h4>
        <h4>
          5&#41; 행정심판에 대한 자세한 사항은 국민권익위원회&#40;
          <button
            onClick={() => {
              window.open("https://www.acrc.go.kr/");
            }}
          >
            www.acrc.go.kr
          </button>
          &#41;홈페이지를 참고하시기 바랍니다.
        </h4>
      </div>
    </AgreeWrap>
  );
};

export default PrivacyPolicy;
