import { AgreeWrap } from "./agreePageStyle";

const TermsService = () => {
  return (
    <AgreeWrap>
      <h2 className="title">[서비스 이용약관]</h2>
      <h3>제 1 조 (목적)</h3>
      <div className="box">
        본 약관은 주식회사 마인즈그라운드의 플랫폼서비스, 마이스메이트(이하
        "회사"라 합니다)가 운영, 제공하는 마이스메이트 서비스 및 관련
        제반서비스, 기타 서비스(이하 "서비스")를 이용함에 있어 회사와 서비스
        이용자의 권리.의무 및 책임사항을 규정함을 목적으로 합니다.
      </div>
      <h3>제 2 조 (정의)</h3>
      <div className="box">
        "서비스 이용자"란 회원과 비회원을 말한다.
        <br />
        "회원"이란 회사에 회원가입을 하고 회사의 가입 승인이 완료된 서비스
        이용자를 말한다.
        <br />
        "비회원"이란 회원에 가입하지 않고 "회사" 서비스를 이용할 수 있는 자를
        말한다. <br />
        "플랫폼"이란 회사가 운영하는 웹사이트를 말한다.
      </div>
      <h3>제 3 조 (약관 등의 명시와 설명 및 개정)</h3>
      <div className="box">
        <span className="num">①</span> 회사는 이 약관의 내용과 상호 및 대표자의
        성명, 영업소 소재지 주소, 전화번호, 사업자등록번호, 등 필요정보를
        이용자가 쉽게 알 수 있도록 플랫폼 메인하단에 게시합니다.
        <br />
        <span className="num">②</span> 회사는 온라인 디지털콘텐츠산업발전법,
        전자상거래 등에서의 소비자보호에 관한 법률, 약관의 규제에 관한 법률,
        소비자기본법, 정보통신망 이용촉진 및 정보보호에 관한법률(이하
        '정보통신망법') 등 관련법을 위배하지 않는 범위에서 본 약관을 개정할 수
        있습니다.
        <br />
        <span className="num">③</span> 회사가 약관을 개정할 경우에는 기존약관과
        개정약관 및 개정약관의 적용일자와 개정사유를 명시하여 현행약관과 함께 그
        적용일자 7일 전부터 적용일 이후 상당한 기간 동안 공지합니다. 다만,
        이용자에게 불리하게 약관내용을 변경하는 경우에는 적용일자 30일 전부터
        적용일 이후 상당한 기간 동안 각각 이를 회사 인터넷 홈페이지에 공지하고
        등록된 서비스이용자의 전자우편주소로 개정약관을 발송하여 고지합니다.
        <br />
        <span className="num">④</span> 회사가 전항에 따라 서비스 이용자에게
        통지하면서 공지 또는 고지일로부터 개정약관 시행일 7일 후까지 거부의사를
        표시하지 아니하면 승인한 것으로 본다는 뜻을 명확하게 고지하였음에도
        의사표시가 없는 경우에는 서비스 이용자가 변경된 약관을 승인한 것으로
        봅니다. 서비스 이용자는 개정약관에 동의하지 않을 경우 제17조제1항의
        규정에 따라 이용계약을 해지할 수 있습니다.
      </div>
      <h3>제 4 조 (회원가입절차)</h3>
      <div className="box">
        <span className="num">①</span> 서비스 이용자가 본 약관을 읽고 "동의"
        버튼을 누르거나 "확인" 등에 체크하는 경우 본 약관에 동의한 것으로
        간주합니다. <br />
        <span className="num">②</span> 회사의 서비스 이용을 위한 회원가입은
        서비스 이용자가 전항과 같이 동의한 후, 회사가 정한 온라인 회원가입
        신청서에 회원 아이디를 포함한 필수사항을 입력하고, 회원가입버튼을 누르는
        방법으로 합니다. 다만, 회사가 필요하다고 인정하는 경우 서비스 이용자에게
        별도의 서류를 제출하도록 할 수 있습니다.
        <br />
      </div>
      <h3>제 5 조 (회원등록의 성립과 유보 및 거절)</h3>
      <div className="box">
        <span className="num">①</span> 회원등록은 제3조에 정한 절차에 의한
        서비스 이용자의 회원가입 신청과 회사의 회원등록 승낙에 의하여
        성립합니다. 회사는 회원가입 신청자가 필수사항 등을 성실히 입력하여
        가입신청을 완료하였을 때에는 필요한 사항을 확인한 후 지체 없이 이를
        승낙하여야 합니다. 단 회원가입 신청서 제출 이외에 별도의 자료 제출이
        요구되는 경우에는 예외로 합니다.
        <br />
        <span className="num">②</span> 회사는 아래 각 호의 어느 하나에 해당하는
        경우에는 회원등록의 승낙을 유보할 수 있습니다.
        <br />
        제공서비스 설비용량에 현실적인 여유가 없는 경우
        <br />
        서비스를 제공하기에는 기술적으로 문제가 있다고 판단되는 경우
        <br />
        기타 회사가 재정적, 기술적으로 필요하다고 인정하는 경우
        <br />
        <br />
        <span className="num">③</span> 회사는 아래 각 호의 어느 하나에 해당하는
        경우에는 회원등록을 거절할 수 있습니다.
        <br />
        가입신청서의 내용을 허위로 기재하였거나 허위서류를 첨부하여 가입신청을
        하는 경우
        <br />
        만14세 미만이 개인정보제공에 대한 동의를 부모 등 법정대리인으로부터 받지
        않은 경우
        <br />
        기타 회사가 관련법령 등을 기준으로 하여 명백하게 사회질서 및 미풍양속에
        반할 우려가 있음을 인정하는 경우
        <br />
        제17조제2항에 의하여 회사가 계약을 해지했던 회원이 다시 회원가입 신청을
        하는 경우
      </div>
      <h3>제 6 조 (회원 아이디 등의 관리책임)</h3>
      <div className="box">
        <span className="num">①</span> 회원은 서비스 이용을 위한 회원 아이디 및
        비밀번호의 관리에 대한 책임을 지며 그 외 본인의 회원 아이디의 제3자에
        의한 부정사용 등 회원의 고의과실로 인해 발생하는 모든 불이익에 대한
        책임을 부담합니다. 단, 이것이 회사의 고의과실로 인하여 야기된 경우는
        회사가 책임을 부담합니다.
        <br />
        <span className="num">②</span> 회원은 회원 아이디 및 비밀번호 그 외
        추가정보 등을 도난당하거나 제3자가 사용하고 있음을 인지한 경우에는 즉시
        본인의 회원 비밀번호를 수정하는 등의 조치를 취하여야 하며 즉시 이를
        회사에 통보하여 회사의 안내를 따라야 합니다.
      </div>
      <h3>제 7 조 (개인정보의 보호)</h3>
      <div className="box">
        <span className="num">①</span> 회사는 서비스를 제공하기 위하여 관련
        법령의 규정에 따라 서비스 이용자로부터 필요한 개인정보를 수집합니다.
        <br />
        <span className="num">②</span> 회사는 서비스의 제공과 관련하여 알게 된
        서비스 이용자의 개인정보를 본인의 동의 없이 제3자에게 누설, 배포하지
        않고, 이를 보호하기 위하여 노력합니다. 서비스 이용자의 개인정보보호에
        관한 기타의 사항은 정보통신망법 및 회사가 별도로 정한
        "개인정보처리방침"에 따릅니다.
      </div>
      <h3>제 8 조 (회원정보의 변경)</h3>
      <div className="box">
        <span className="num">①</span> 회원은 서비스 설정화면에서 언제든지
        본인의 회원정보를 열람하고 수정할 수 있습니다. 다만, 서비스 관리를 위해
        회원 아이디 등은 수정이 불가능합니다.
        <br />
        <span className="num">②</span> 회원은 회원가입 신청 시 기재한 사항이
        변경되었을 경우, 온라인으로 수정을 하거나 전자우편 등 기타 방법으로
        회사에 대하여 그 변경사항을 알려야 합니다.
        <br />
        <span className="num">③</span> 회원이 전항의 변경사항을 회사에 알리지
        않아 발생한 불이익에 대하여 회사는 책임지지 않습니다.
      </div>
      <h3>제 9 조 (서비스 범위 및 이용)</h3>
      <div className="box">
        <span className="num">①</span> 회사는 서비스 이용자에게 아래와 같은
        서비스를 제공합니다.
        <br />
        가. 플랫폼서비스 행사의 주최, 행사 참가자 모집, 관리 및 등록, 행사페이지
        개설, 행사안내 메일 및 문자전송, 행사정보안내 등 서비스 이용자에게
        제공되는 서비스와 그 외 원활한 행사진행을 위하여 행사 기획부터 행사 종료
        후 사후관리까지 행사전반에 걸쳐서 서비스 이용자에게 제공되는 서비스
        <br />
        나. 행사가이드서비스
        <br />
        사이트 내에서 제공하는 행사 추천, 부스 추천, 챗봇 등 행사참가자에게
        제공하는 서비스
        <br />
        기타 서비스
        <br />
        제1호의 서비스와 관련한 부가서비스 및 그 외 회사가 추가 개발하거나 다른
        회사와의 제휴 계약 등을 통해 서비스 이용자에게 제공하는 일체의 서비스
        <br />
        <span className="num">②</span> 서비스 이용은 회사의 서비스 사용승낙
        직후부터 가능합니다. <br />
        <span className="num">③</span> 민법상 미성년자인 서비스 이용자가
        유료서비스를 이용할 경우 미성년자인 서비스 이용자는 결제 전 법정대리인의
        동의를 얻어야 합니다.
        <br />
        <span className="num">④</span> 서비스 이용시간은 회사의 업무상 또는
        기술상 불가능한 경우를 제외하고는 연중무휴 1일 24시간(00:00-24:00)으로
        함을 원칙으로 합니다. 다만, 서비스설비의 정기점검 등의 사유로 회사가
        서비스를 특정범위로 분할하여 별도로 날짜와 시간을 정할 수 있습니다.
        <br />
      </div>
      <h3>제 10 조 (서비스 이용자에 대한 통지 등)</h3>
      <div className="box">
        <span className="num">①</span> 회사가 서비스 이용자에게 통지하는 경우
        등록된 서비스 이용자의 전자우편주소로 통지할 수 있습니다.
        <br />
        <span className="num">②</span> 전항의 경우 불특정 다수인을 상대로 통지를
        함에 있어서는 7일 이상 사이트의 공지사항 페이지 등에 게시함으로써 전항의
        통지를 갈음할 수 있습니다. 단, 서비스 이용자 본인의 거래와 관련하여
        중대한 영향을 미치는 사항은 상당한 기간 동안 게시판을 통해 이를 공지하고
        서비스 이용자의 등록된 전자우편주소로 개별통지합니다.
      </div>
      <h3>제 11 조 (권리의 귀속 및 저작물의 이용)</h3>
      <div className="box">
        <span className="num">①</span> 서비스 이용자가 서비스 내에 게시한 게시물
        등(이하 "게시물 등"이라 합니다)의 저작권은 해당 게시물 등의 저작자에게
        귀속되며, 해당 게시물 등이 타인의 지적재산권을 침해하여 발생되는 모든
        책임은 저작자에게 있습니다
        <br />
        <br />
        <span className="num">②</span> 게시물 등은 검색결과 내지 서비스 및 관련
        프로모션 등에 노출될 수 있으며, 해당 노출을 위해 필요한 범위 내에서는
        일부 수정, 복제, 편집되어 게시될 수 있습니다. 이 경우, 회사는 저작권법
        규정을 준수하며, 서비스 이용자는 언제든지 고객센터 또는 각 서비스 내
        관리기능을 통해 해당 게시물 등에 대해 삭제, 검색결과 제외, 비공개 등의
        조치를 요청할 수 있습니다.
        <br />
        <span className="num">③</span> 회사는 전항 이외의 방법으로 서비스
        이용자의 게시물 등을 이용하고자 하는 경우에는 전화, 팩스, 전자우편 등을
        통해 사전에 서비스 이용자의 동의를 얻습니다.
        <br />
        <span className="num">④</span> 서비스 이용자의 게시물 등에 대해
        제3자로부터 저작권 및 기타 권리의 침해로 이의가 제기된 경우 회사는 해당
        게시물 등을 법령에 따라 정지 또는 삭제할 수 있습니다.
        <br />
        <span className="num">⑤</span> 회사가 작성한 저작물에 대한 저작권 기타
        지적재산권은 회사에 귀속합니다.
      </div>
      <h3>제 12 조 (서비스 이용의 제한 및 중지)</h3>
      <div className="box">
        <span className="num">①</span> 회사는 아래 각 호의 어느 하나에 해당하는
        사유가 발생한 경우에는 서비스 이용자의 서비스 이용을 제한하거나 중지시킬
        수 있습니다.
        <br />
        서비스 이용자가 회사 서비스의 운영을 고의과실로 방해하는 경우
        <br />
        서비스 이용자가 제13조의 의무를 위반한 경우
        <br />
        서비스용 설비 점검, 교체, 보수 또는 공사로 인하여 부득이한 경우
        <br />
        전기통신사업법에 규정된 기간통신사업자가 전기통신 서비스를 중지했을 경우
        <br />
        국가비상사태, 서비스의 장애 또는 서비스 이용의 폭주 등 서비스 이용에
        지장이 있을 때<br />
        기타 중대한 사유로 인하여 회사가 서비스 제공이 부적당하다고 인정하는
        경우
        <br />
        <br />
        <span className="num">②</span> 회사는 전항의 규정에 의하여 서비스의
        이용을 제한하거나 중지한 때에는 그 사유 및 제한 기간 등을 제9조의 규정에
        따라 서비스 이용자에게 알려야 합니다.
        <br />
        <span className="num">③</span> 제17조 제2항에 의해 회사가 회원과의
        계약을 해지하고 탈퇴시키기로 결정한 경우 회사는 회원의 탈퇴 처리 전에
        이를 제9조의 규정에 따라 회원에게 통지하고, 회원은 회사의 통지를 받은
        날로부터 30일 이내에 이에 대한 항변의 기회를 가집니다.
        <br />
        <span className="num">④</span> 회원이 서비스를 이용하는 도중, 연속하여
        12개월 동안 서비스를 이용하기 위해 log-in한 기록이 없는 경우, 회사는
        당해 회원의 서비스이용을 제한할 수 있습니다.
        <br />
        <span className="num">⑤</span> 정보통신망법에 의해 다른 서비스 이용자의
        공개된 게시물 등이 본인의 사생활을 침해하거나 명예를 훼손하는 등 권리를
        침해 받은 서비스 이용자 또는 제3자(이하 "삭제 등 신청인"이라 합니다)는
        그 침해사실을 소명하여 회사에 해당 게시물 등의 삭제 또는 반박 내용의
        게재를 요청할 수 있습니다. 이 경우 회사는 해당 게시물 등의 권리 침해
        여부를 판단할 수 없거나 당사자 간의 다툼이 예상되는 경우 해당 게시물
        등에 대한 접근을 임시적으로 차단하는 조치(이하 "임시조치"라 합니다)를
        최장 30일까지 취합니다.
        <br />
        <span className="num">⑥</span> 제5항에 의해 본인의 게시물 등이
        임시조치된 서비스 이용자(이하 "게시자"라 합니다)는 임시조치기간 중
        회사에 해당 게시물 등을 복원해 줄 것을 요청(이하 "재게시 청구"라
        합니다)할 수 있으며, 회사는 임시조치된 게시물 등의 명예훼손 등 판단에
        대한 방송통신심의위원회 심의 요청에 대한 게시자 및 삭제 등 신청인의
        동의가 있는 경우 게시자 및 삭제 등 신청인을 대리하여 이를 요청하고
        동의가 없는 경우 회사가 이를 판단하여 게시물 등의 복원 여부를
        결정합니다. 게시자의 재게시 청구가 있는 경우 임시조치 기간 내에
        방송통신심의위원회 또는 회사의 결정이 있으면 그 결정에 따르고 그 결정이
        임시조치 기간 내에 있지 않는 경우 해당 게시물 등은 임시조치 만료일 이후
        복원됩니다. 재게시 청구가 없는 경우 해당 게시물 등은 임시조치 기간 만료
        이후 삭제됩니다.
        <br />
        <span className="num">⑦</span> 회사는 서비스 내에 게시된 게시물 등이
        사생활 침해 또는 명예훼손 등 제3자의 권리를 침해한다고 인정하는 경우
        제5항에 따른 서비스 이용자 또는 제3자의 신고가 없는 경우에도
        임시조치(이하 "임의의 임시조치"라 합니다)를 취할 수 있습니다. 임의의
        임시조치된 게시물 등의 처리 절차는 제5항 후단 및 제6항의 규정에
        따릅니다.
        <br />
        <span className="num">⑧</span> 서비스 이용자의 게시물 등으로 인한 법률상
        이익 침해를 근거로, 다른 서비스 이용자 또는 제3자가 서비스 이용자 또는
        회사를 대상으로 하여 민형사상의 법적 조치(예: 형사고소, 가처분 신청,
        손해배상청구 등 민사소송의 제기)를 취하는 경우, 회사는 동 법적 조치의
        결과인 법원의 확정판결이 있을 때까지 관련 게시물 등에 대한 접근을
        잠정적으로 제한할 수 있습니다. 게시물 등의 접근 제한과 관련한 법적
        조치의 소명, 법원의 확정판결에 대한 소명 책임은 게시물 등에 대한 조치를
        요청하는 자가 부담합니다.
      </div>
      <h3>제 13 조 (회사의 의무)</h3>
      <div className="box">
        <span className="num">①</span> 회사는 회사의 서비스 제공 및 보안과
        관련된 설비를 지속적이고 안정적인 서비스 제공에 적합하도록 유지, 점검
        또는 복구 등의 조치를 성실히 이행하여야 합니다.
        <br />
        <span className="num">②</span> 회사는 서비스 이용자가 수신 동의를 하지
        않은 영리 목적의 광고성 전자우편, SMS 문자메시지 등을 발송하지
        아니합니다.
      </div>
      <h3>제 14 조 (서비스 이용자의 의무)</h3>
      <div className="box">
        <span className="num">①</span> 서비스 이용자는 아래 각 호의 어느 하나에
        해당하는 행위를 하여서는 아니 됩니다.
        <br />
        <br />
        회원가입신청 또는 변경 시 허위내용을 등록하는 행위
        <br />
        서비스에 게시된 정보를 변경하거나 서비스를 이용하여 얻은 정보를 회사의
        사전 승낙 없이 영리 또는 비영리의 목적으로 복제, 출판, 방송 등에
        사용하거나 제3자에게 제공하는 행위.
        <br />
        회사가 제공하는 서비스를 이용하여 제3자에게 본인을 홍보할 기회를
        제공하거나 제3자의 홍보를 대행하는 등의 방법으로 금전을 수수하거나
        서비스를 이용할 권리를 양도하고 이를 대가로 금전을 수수하는 행위.
        <br />
        회사 및 기타 제3자에 대한 허위의 사실을 게재하거나 지적재산권을 침해하는
        등 회사나 제3자의 권리를 침해하는 행위
        <br />
        다른 회원 아이디 및 비밀번호를 도용하여 부당하게 서비스를 이용하는 행위
        <br />
        정크메일(junk mail), 스팸메일(spam mail), 행운의 편지(chain letters),
        피라미드 조직에
        <br />
        가입할 것을 권유하는 메일, 외설 또는 폭력적인 메시지&화상&음성 등이 담긴
        메일을
        <br />
        보내거나 기타 공서양속에 반하는 정보를 공개 또는 게시하는 행위
        <br />
        정보통신망법 등 관련 법령에 의하여 그 전송 또는 게시가 금지되는
        정보(컴퓨터 프로그램 등)를 전송하거나 게시하는 행위
        <br />
        청소년보호법에서 규정하는 청소년유해매체물을 게시하는 행위
        <br />
        공공질서 또는 미풍양속에 위배되는 내용의 정보, 문장, 도형, 음성 등을
        유포하는 행위
        <br />
        회사의 직원이나 서비스의 관리자를 가장하거나 사칭 또는 타인의 명의를
        도용하여 글을 게시하거나 메일을 발송하는 행위
        <br />
        컴퓨터 소프트웨어, 하드웨어, 전기통신 장비의 정상적인 가동을 방해,
        파괴할 목적으로 고안된 소프트웨어 바이러스, 기타 다른 컴퓨터 코드, 파일,
        프로그램을 포함하고 있는 자료를 게시하거나 전자우편으로 발송하는 행위
        <br />
        스토킹(stalking), 욕설, 채팅글 도배 등 다른 서비스 이용자의 서비스
        이용을 방해하는 행위
        <br />
        다른 서비스 이용자의 개인정보를 그 동의 없이 수집, 저장, 공개하는 행위
        <br />
        불특정 다수의 서비스 이용자를 대상으로 하여 광고 또는 선전을 게시하거나
        스팸메일을 전송할 목적으로 회사에서 제공하는 메일발송 등의 서비스를
        이용하여 영리활동을 하는 행위
        <br />
        회사가 제공하는 소프트웨어 등을 개작하거나 리버스 엔지니어링, 디컴파일,
        디스어셈블 하는 행위.
        <br />
        현행 법령, 본 약관 기타 서비스 이용에 관한 규정을 위반하는 행위
        <br />
        <br />
        <span className="num">②</span> 회사는 서비스 이용자가 전항의 행위를 하는
        경우 해당 게시물 등을 삭제 또는 임시조치할 수 있고 서비스의 이용을
        제한하거나 일방적으로 본 계약을 해지할 수 있습니다.
        <br />
        <span className="num">③</span> 회사가 제공하는 서비스 중 관련 법령 등의
        규정에 의하여 성인인증이 필요한 경우 서비스 이용자는 해당 서비스를
        이용하기 위하여 회사가 제공하는 방법에 따라 실명정보를 회사에 제공하여야
        합니다.
      </div>
      <h3>제 15 조 (양도금지)</h3>
      <div className="box">
        서비스 이용자의 서비스 받을 권리는 이를 양도 내지 증여하거나 질권의
        목적으로 사용할 수 없습니다.
      </div>
      <h3>제 16 조 (이용계약의 해지)</h3>
      <div className="box">
        <span className="num">①</span> 서비스 이용자가 서비스 이용계약을
        해지하고자 하는 때에는 언제든지 '문의하기' 또는 마이페이지에서 회원탈퇴
        신청 후, 회사가 정한 절차에 따라 서비스 이용계약을 해지하거나 회원
        아이디를 삭제하고 탈퇴할 수 있습니다.
        <br />
        <span className="num">②</span> 서비스 이용자가 제13조의 규정을 위반한
        경우 회사는 일방적으로 본 계약을 해지할 수 있고, 이로 인하여 서비스
        운영에 손해가 발생한 경우 이에 대한 민형사상 책임도 물을 수 있습니다.
        <br />
        <span className="num">③</span> 회원이 서비스를 이용하는 도중, 연속하여
        1년 동안 서비스를 이용하기 위해 회사의 서비스에 log-in한 기록이 없는
        경우 회사는 당해 회원의 회원자격을 상실시킬 수 있습니다.
        <br />
        <span className="num">④</span> 유료서비스 이용계약의 해지는 서비스
        이용자의 서비스 해지신청 및 회사의 승낙에 의해 성립합니다. 단, 정기 결제
        서비스의 경우 정기결제 페이지에서 '해지하기' 버튼을 클릭하면 다음
        결제일부터 자동 결제가 진행되지 않습니다.
        <br />
        <span className="num">⑤</span> 회사가 승낙한 시점에 해지의 효과는
        발생하며 환불에 대해서는 제16조의 규정을 따릅니다.
        <br />
        <span className="num">⑥</span> 각 개별 유료서비스에서 전항의 규정과 다른
        계약해지의 방법 및 효과를 개별약관에서 규정하고 있는 경우 각 개별
        유료서비스의 계약해지에 관해서는 당해 개별 약관의 규정을 따릅니다.
      </div>
      <h3>제 17 조 (면책)</h3>
      <div className="box">
        회사는 다음 각 호의 경우로 서비스를 제공할 수 없는 경우 이로 인하여
        서비스 이용자에게 발생한 손해에 대해서는 책임을 부담하지 않습니다.
        <br />
        천재지변 또는 이에 준하는 불가항력의 상태가 있는 경우
        <br />
        서비스 제공을 위하여 회사와 서비스 제휴계약을 체결한 제3자의 고의적인
        서비스 방해가 있는 경우
        <br />
        서비스 이용자의 귀책사유로 서비스 이용에 장애가 있는 경우
        <br />
        제1호 내지 제3호를 제외한 기타 회사의 고의과실이 없는 사유로 인한 경우
      </div>
      <h3>제18조 (재판권 및 준거법)</h3>
      <div className="box">
        <span className="num">①</span> 회사와 서비스 이용자 간에 발생한
        전자상거래 분쟁에 관한 소송은 제소 당시 서비스 이용자의 주소에 의하고,
        주소가 없는 경우에는 거소를 관할하는 법원을 전속관할로 합니다. 다만,
        전자상거래 외 분쟁의 경우와 제소 당시 서비스 이용자의 주소 또는 거소가
        분명하지 않거나 외국거주자의 경우에는 민사소송법상의 관할법원에 소송을
        제기합니다.
        <br />
        <span className="num">②</span> 본 약관은 대한민국 법률에 따라 규율되고
        해석됩니다.
        <br />
        <span className="num">③</span> 본 약관에 명시되지 않은 사항에 대해서는
        관련법령에 의하고, 법에 명시되지 않은 부분에 대하여는 관습에 의합니다.
      </div>
    </AgreeWrap>
  );
};

export default TermsService;
